{
    "Programming": [
        {
            "name": "Java",
            "description": "I am \"fluent\" in Java. I have a strong understanding of Java's object oriented programming model, multithreading architechture, i/o frameworks, and just about everything else.",
            "rating": 9,
            "thumb": "media/skills/java-logo.jpg"
        },
        {
            "name": "JavaScript",
            "description": "There's some both terrible and wonderful about JavaScript. With it, I have created front-end webapps, backend webservers in Node.js, and everything inbetween.",
            "rating": 9
        },
        {
            "name": "Markup Languages",
            "description": "XML, JSON, and YAML are all important for programming, and I have worked with all of them.",
            "rating": 9
        },
        {
            "name": "GNU+Linux",
            "description": "Linux is great, and it is used on two-thirds of all internet servers. I own and run a small headless linux server as a hobby. I have also worked with Amazon Web Services (AWS) to automate server deployment, manage clusters, and balance loads.",
            "rating": 9
        },
        {
            "name": "Front-End Web Frameworks",
            "description": "I am great with Bootstrap, Skeleton.css, Foundation, and more. This website uses Foundation, compiled with SASS, and AngularJs",
            "rating": 9
        },
        {
            "name": "Python",
            "description": "I have strong experience in Python, especially the Django web framework",
            "rating": 7
        },
        {
            "name": "PHP",
            "description": "Like many others, PHP was my first web framework.",
            "rating": 6
        },
        {
            "name": "Shell Scripting",
            "description": "Ba/sh, Batch, and more. Great for automating system maintainence and more.",
            "rating": 6
        }
    ],
    "Music": [
        {
            "name": "Trumpet",
            "description": "I have played trumpet since 4th grade, and have experience in concert band, pep band, and musical settings.",
            "rating": 6
        },
        {
            "name": "Digital Sound Design and Music Production",
            "description": "I took up digital music creation as a hobby. Using online tutorials, I have learned advanced sound design techniques, including subtractive, additive, and frequency-modulation synthesis." ,
            "rating": 5
        }
    ]
}